
<div class="test message">
  <h1 class="test heading">Какое направление в IT выбрать?</h1>
  <div class="test text">
    <p class="test paragraph">Пройдите тестирование и узнайте, какие профессии в программировании вам подходят!</p>
    <p class="test paragraph">Тест поможет вам сориентироваться в IT-профессиях и покажет те, которые вам больше
      всего подходят. Прохождение тестирования займет не более 2-3 минут.</p>
    <p class="test paragraph">Чтобы начать прохождение теста, нажмите на «Далее» ниже.</p>
  </div>
</div>
