export const test = [{
  questions: [
    {
      variant: 'Работать над созданием приложений с виртуальной или дополненной реальностью',
      group: 4,
    },
    {
      variant: 'Делать из макетов дизайнеров красивые и аккуратные сайты',
      group: 3,
    },
  ],
  isActive: true,
}, {
  questions: [
    {
      variant: 'Создавать в мобильном приложении плавные переходы и интересные анимации',
      group: 4,
    },
    {
      variant: 'Придумывать новые и нетривиальные способы поиска ошибок',
      group: 2,
    },
  ],
  isActive: false,
}, {
  questions: [
    {
      variant: 'Делать мобильное приложение удобным и комфортным для пользователя',
      group: 4,
    },
    {
      variant: 'Делать важную, но малозаметную работу: оптимизировать, настраивать и обеспечивать надежность сайта',
      group: 1,
    },
  ],
  isActive: false,
}, {
  questions: [
    {
      variant: 'Программировать сайты так, чтобы на любых устройствах они отображались хорошо',
      group: 3,
    },
    {
      variant: 'Искать ошибки и придумывать способы, как лучше их исправить',
      group: 2,
    },
  ],
  isActive: false,
}, {
  questions: [
    {
      variant: 'Быть специалистом, от внимания которого не ускользнет ни один сдвинутый пиксель',
      group: 2,
    },
    {
      variant: 'Уметь делать всю работу целиком - от идеи и до последней строчки кода',
      group: 1,
    },
  ],
  isActive: false,
}, {
  questions: [
    {
      variant: 'Делать сайты удобными и понятными для пользователей',
      group: 3,
    },
    {
      variant: 'Разносторонне продумывать логику и внутреннюю структуру будущей программы',
      group: 1,
    },
  ],
  isActive: false,
}, {
  questions: [
    {
      variant: 'Активно использовать в программировании микрофон, камеру, геолокацию и др. функции мобильного телефона',
      group: 4,
    },
    {
      variant: 'Делать сайты комфортными для людей с ограниченными возможностями',
      group: 3,
    },
  ],
  isActive: false,
}, {
  questions: [
    {
      variant: 'Работать над программированием новых фишек мобильного приложения',
      group: 4,
    },
    {
      variant: 'Придумывать программы, которые автоматически ищут ошибки',
      group: 2,
    },
  ],
  isActive: false,
}, {
  questions: [
    {
      variant: 'Внедрять в мобильное приложение аналитику поведения пользователя',
      group: 4,
    },
    {
      variant: 'Уметь одинаково хорошо и настраивать операционные системы, и программировать сайты',
      group: 1,
    },
  ],
  isActive: false,
}, {
  questions: [
    {
      variant: 'Создавать на сайте интересные эффекты и анимации',
      group: 3,
    },
    {
      variant: 'Педантично, шаг за шагом, проверять правильность работы каждой детали',
      group: 2,
    },
  ],
  isActive: false,
}, {
  questions: [
    {
      variant: 'Программировать различные детали сайта - кнопки, прогресс-бары и др.',
      group: 3,
    },
    {
      variant: 'Анализировать разнородные данные и собирать их в единое целое',
      group: 1,
    },
  ],
  isActive: false,
}, {
  questions: [
    {
      variant: 'Находить даже минимальные расхождения между тем, как должна работать программа, и тем, как она работает сейчас',
      group: 2,
    },
    {
      variant: 'Разбираться во всех областях программирования, пусть даже и поверхностно',
      group: 1,
    },
  ],
  isActive: false,
},
];
