export const test = [{
  questions: [
    {
      variant: 'Работать над созданием приложений с виртуальной или дополненной реальностью',
      group: 4,
    },
    {
      variant: 'Делать из макетов дизайнеров красивые и аккуратные сайты',
      group: 3,
    },
  ],
  isActive: true,
}, {
  questions: [
    {
      variant: 'Создавать в мобильном приложении плавные переходы и интересные анимации',
      group: 4,
    },
    {
      variant: 'Придумывать новые и нетривиальные способы поиска ошибок',
      group: 2,
    },
  ],
  isActive: false,
}, {
  questions: [
    {
      variant: 'Делать мобильное приложение удобным и комфортным для пользователя',
      group: 4,
    },
    {
      variant: 'Делать важную, но малозаметную работу: оптимизировать, настраивать и обеспечивать надежность сайта',
      group: 1,
    },
  ],
  isActive: false,
}, {
  questions: [
    {
      variant: 'Программировать сайты так, чтобы на любых устройствах они отображались хорошо',
      group: 3,
    },
    {
      variant: 'Искать ошибки и придумывать способы, как лучше их исправить',
      group: 2,
    },
  ],
  isActive: false,
}, {
  questions: [
    {
      variant: 'Быть специалистом, от внимания которого не ускользнет ни один сдвинутый пиксель',
      group: 2,
    },
    {
      variant: 'Уметь делать всю работу целиком - от идеи и до последней строчки кода',
      group: 1,
    },
  ],
  isActive: false,
}, {
  questions: [
    {
      variant: 'Делать сайты удобными и понятными для пользователей',
      group: 3,
    },
    {
      variant: 'Разносторонне продумывать логику и внутреннюю структуру будущей программы',
      group: 1,
    },
  ],
  isActive: false,
}, {
  questions: [
    {
      variant: 'Активно использовать в программировании микрофон, камеру, геолокацию и др. функции мобильного телефона',
      group: 4,
    },
    {
      variant: 'Делать сайты комфортными для людей с ограниченными возможностями',
      group: 3,
    },
  ],
  isActive: false,
}, {
  questions: [
    {
      variant: 'Работать над программированием новых фишек мобильного приложения',
      group: 4,
    },
    {
      variant: 'Придумывать программы, которые автоматически ищут ошибки',
      group: 2,
    },
  ],
  isActive: false,
}, {
  questions: [
    {
      variant: 'Внедрять в мобильное приложение аналитику поведения пользователя',
      group: 4,
    },
    {
      variant: 'Уметь одинаково хорошо и настраивать операционные системы, и программировать сайты',
      group: 1,
    },
  ],
  isActive: false,
}, {
  questions: [
    {
      variant: 'Создавать на сайте интересные эффекты и анимации',
      group: 3,
    },
    {
      variant: 'Педантично, шаг за шагом, проверять правильность работы каждой детали',
      group: 2,
    },
  ],
  isActive: false,
}, {
  questions: [
    {
      variant: 'Программировать различные детали сайта - кнопки, прогресс-бары и др.',
      group: 3,
    },
    {
      variant: 'Анализировать разнородные данные и собирать их в единое целое',
      group: 1,
    },
  ],
  isActive: false,
}, {
  questions: [
    {
      variant: 'Находить даже минимальные расхождения между тем, как должна работать программа, и тем, как она работает сейчас',
      group: 2,
    },
    {
      variant: 'Разбираться во всех областях программирования, пусть даже и поверхностно',
      group: 1,
    },
  ],
  isActive: false,
},
];


export const resultText = {
  1: {
    name: 'Fullstack-разработчик',
    p: [
      'Фулстек веб-разработчик – это программист, который способен принимать активное участие во всех этапах разработки: начиная с разработки серверной логики будущего приложения и заканчивая клиентским кодом, работающим в браузере.',
      'Наиболее ценно в таком специалисте умение планировать структуру приложения, представлять, как все его части будут взаимодействовать друг с другом и с внешними компонентами. Первостепенная задача – обеспечить создание правильного скелета приложения, который в дальнейшем выдержит нарастающую нагрузку в виде новых фич и компонентов. Фулстек-разработчик может самостоятельно сделать свое приложение “под ключ”.'
    ],
    recommendations: [
      {
        text: 'Веб-разработчик с нуля',
        link: 'https://netology.ru/programs/web-developer',
      },
      {
        text: 'Python-разработчик',
        link: 'https://netology.ru/programs/python',
      },
      {
        text: 'Golang-разработчик с нуля',
        link: 'https://netology.ru/programs/godeveloper',
      },
      {
        text: 'Django: создание функциональных веб-приложений',
        link: 'https://netology.ru/programs/django',
      }
    ],
  },
  2: {
    name: 'Тестировщик',
    p: [
      'QA-инженер или тестировщик – это специалист, который отвечает за качество и безошибочную работу продукта. Он тестирует продукт, ищет возможные ошибки и исправляет их. Тестировщики часто проверяют не только правильность работы продукта, но и работу программистов, поэтому иногда просматривают их код:)',
      'Очень привлекательной эта профессия стала из-за того, что на начальных этапах профессия не всегда требует знаний языков программирования, обширного технического бэкграунда, глубокого понимания современных технологий и т.д.  Поэтому начать IT карьеру с тестировщика – это наиболее частый и простой выбор IT новичков или людей, которые переучиваются со своей текущей специальности на IT.',
    ],
    recommendations: [
      {
        text: 'Тестировщик',
        link: 'https://netology.ru/programs/qa'
      }
    ],
  },
  3: {
    name: 'Фронтенд-разработчик',
    p: [
      'Фронтенд-разработчик – программист, создающий внешний пользовательский функционал web-сайта и отвечающий за его соответствие макету дизайна и за единообразное отображение страниц в любом браузере. Это специалист, от которого зависит, насколько удобным и функциональным будет интерфейс сайта или приложения.',
      'В некоторых случаях, если макет не отражает деталей концепта, фронтенд-разработчик может проявлять себя в качестве дизайнера, когда от сотрудника требуется верстка уже готового макета (с помощью связки HTML+CSS).'
    ],
    recommendations: [
      {
        text: 'Frontend-разработчик',
        link: 'https://netology.ru/programs/front-end',
      },
      {
        text: 'React: библиотека фронтенд-разработки',
        link: 'https://netology.ru/programs/react',
      }
    ],
  },
  4: {
    name: 'Мобильный разработчик',
    p: [
      'Мобильный разработчик — это специалист, разрабатывающий программные приложения для различных мобильных устройств: планшетов, смартфонов. Сейчас эта профессия очень популярная, перспективная и востребованная. Ведь именно в сфере мобильной разработки появились такие интересные новинки как голосовой и жестовый интерфейс.',
    ],
    recommendations: [
      {
        text: 'Android-разработчик с нуля',
        link: 'https://netology.ru/programs/android-app',
      },
      {
        text: 'iOS-разработчик с нуля',
        link: 'https://netology.ru/programs/ios-developer',
      },
      {
        text: 'Разработчик на Kotlin',
        link: 'https://netology.ru/programs/kotlindevelopment',
      },
    ]
  }
};

