

export const groups = {
  1: {
    name: 'Fullstack-разработчик',
    description: [
      'Разбираться во всех областях программирования, пусть даже и поверхностно',
      'Уметь делать всю работу целиком - от идеи и до последней строчки кода',
      'Уметь одинаково хорошо и настраивать операционные системы, и программировать сайты',
      'Разносторонне продумывать логику и внутреннюю структуру будущей программы',
      'Анализировать разнородные данные и собирать их в единое целое',
      'Делать важную, но малозаметную работу: оптимизировать, настраивать и обеспечивать надежность сайта',
    ],
  },
  2: {
    name: 'QA-специалист',
    description: [
      'Находить даже минимальные расхождения между тем, как должна работать программа, и тем, как она работает сейчас',
      'Искать ошибки и придумывать способы, как лучше их исправить',
      'Придумывать программы, которые автоматически ищут ошибки',
      'Педантично, шаг за шагом, проверять правильность работы каждой детали',
      'Придумывать новые и нетривиальные способы поиска ошибок',
      'Быть специалистом, от внимания которого не ускользнет ни один сдвинутый пиксель',
    ],
  },
  3: {
    name: 'Frontend-разработчик',
    description: [
      'Делать из макетов дизайнера красивые и аккуратные сайты',
      'Программировать сайты так, чтобы на любых устройствах они отображались хорошо',
      'Делать сайты удобными и понятными для пользователей',
      'Создавать на сайте интересные эффекты и анимации',
      'Программировать различные детали сайта - кнопки, прогресс-бары и др.',
      'Делать сайты комфортными для людей с ограниченными возможностями',
    ],
  },
  4: {
    name: 'Разработчик мобильных приложений',
    description: [
      'Делать мобильное приложение удобным и комфортным для пользователя',
      'Работать над созданием приложений с виртуальной или дополненной реальностью',
      'Активно использовать в программировании микрофон, камеру, геолокацию и др. функции мобильного телефона',
      'Работать над программированием новых фишек мобильного приложения',
      'Внедрять в мобильное приложение аналитику поведения пользователя',
      'Создавать в мобильном приложении плавные переходы и интересные анимации',
    ]
  }
};
